      /if not defined(COPYRIGHT_DSPEC)
     h COPYRIGHT('V1.9 - 17.01.2021 - mailto: thomas.raddatz@tools400.de')
      /eof
      /endif
     d RTVFLDA_VERSION...
     d                 C                   '1.9'
     d RTVFLDA_DATE...
     d                 C                   '17.01.2021'
      *
