      /if not defined(COPYRIGHT_DSPEC)
     h COPYRIGHT('V1.10 - 08.09.2024 - mailto: thomas.raddatz@tools400.de')
      /eof
      /endif
     d RTVFLDA_VERSION...
     d                 C                   '1.10'
     d RTVFLDA_DATE...
     d                 C                   '08.09.2024'
      *
