      /if not defined(COPYRIGHT_DSPEC)
     h COPYRIGHT('V1.8 - 09.02.2017 - mailto: thomas.raddatz@tools400.de')
      /eof
      /endif
     d RTVFLDA_VERSION...
     d                 C                   '1.8'
     d RTVFLDA_DATE...
     d                 C                   '09.02.2017'
      *
